export const regxValidate = {
    login: {
        regx: /^[a-z0-9-_]{3,20}$/i,
        error: 'от 3 до 20 символов, латиница'
    },
    password: {
        regx: /(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])[0-9a-zA-Z!@#$%^&*]{8,40}/g,
        error: 'от 8 до 40 символов, обязательно хотя бы одна заглавная буква и цифра'
    },
    mail: {
        regx: /^([a-z0-9_-]+\.)*[a-z0-9_-]+@[a-z0-9_-]+(\.[a-z0-9_-]+)*\.[a-z]{2,6}$/,
        error: 'Введите email'
    },
    first_name: {
        regx: /^[А-ЯA-Z][а-яА-ЯёЁa-zA-Z]+$/,
        error: 'Латиница или Кирилица, первая буква Заглавная'
    },
    second_name: {
        regx: /^[А-ЯA-Z][а-яА-ЯёЁa-zA-Z]+$/,
        error: 'Латиница или Кирилица, первая буква Заглавная'
    },
    phone: {
        regx: /^(\s*)?(\+)?([- _():=+]?\d[- _():=+]?){10,15}(\s*)?$/,
        error: 'Введите телефон'
    },

}